Revit 2027 API
AreaReinforcement.GetLayerDirection Method
 Gets the direction of the layer. The lines are distributed along this direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetLayerDirection(
	AreaReinforcementLayerType layer
)
Public Function GetLayerDirection (
	layer As AreaReinforcementLayerType
) As XYZ
public:
XYZ^ GetLayerDirection(
	AreaReinforcementLayerType layer
)
member GetLayerDirection :
        layer : AreaReinforcementLayerType -> XYZ
Parameters
layer AreaReinforcementLayerType
 The layer type.
Return Value
XYZ
 Returns the direction of the desired layer.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InapplicableDataException |  The layer layer isn't active.
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace